<template>
  <yd-layout style="background-color: white;">
    <yd-navbar slot="navbar" title="商品详情">
      <router-link to="/index" slot="left">
        <yd-navbar-back-icon></yd-navbar-back-icon>
      </router-link>
    </yd-navbar>
    <div>

      <yd-slider autoplay="3000">
        <yd-slider-item>
          <a href="#">
            <img src="http://static.ydcss.com/uploads/ydui/1.jpg">
          </a>
        </yd-slider-item>
        <yd-slider-item>
          <a href="#">
            <img src="http://static.ydcss.com/uploads/ydui/2.jpg">
          </a>
        </yd-slider-item>
        <yd-slider-item>
          <a href="#">
            <img src="http://static.ydcss.com/uploads/ydui/3.jpg">
          </a>
        </yd-slider-item>
      </yd-slider>

      <yd-cell-group>

        <yd-cell-item>
          <span slot="left" style="white-space:normal;margin-top: 10px;margin-bottom: 10px">商品名称商品名称商品名称商品名称商品名称商品名称商品名称商品名称商品名称商品名称商品名称商品名称商品名称</span>
        </yd-cell-item>
        <yd-cell-item>
          <span slot="left">
            数量:
          </span>
          <span slot="left">
             <yd-spinner v-model="spinner3"></yd-spinner>
          </span>
          <span slot="left">(库存数45)</span>

        </yd-cell-item>
        <yd-cell-item>
          <div slot="left">
            <span class="list-price1">价格<em>¥</em>567</span>
            <span class="list-del-price1">¥8000</span>
          </div>
          <div slot="right" class="list-price1">
            销量67
          </div>

        </yd-cell-item>
      </yd-cell-group>
      <yd-tab>
        <yd-tab-panel label="商品介绍" class="label-panel-css">我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，
          <img src="http://static.ydcss.com/uploads/ydui/2.jpg">
          图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之
          间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。
        </yd-tab-panel>
        <yd-tab-panel label="商品参数" class="label-panel-css">
          时间是一切财富中最宝贵的财富真理惟一可靠的标准就是永远自相符合真理惟一可靠的标准就是永远自相符合真理惟一可靠的标准就是永远自相符合真理惟一可靠的标准就是永远自相符合真理惟一可靠的标准就是永远自相符合。
        </yd-tab-panel>
        <yd-tab-panel label="商品推荐" class="label-panel-css">
          真理惟一可靠的标准就是永远自相符合。真理惟一可靠的标准就是永远自相符合真理惟一可靠的标准就是永远自相符合真理惟一可靠的标准就是永远自相符合
        </yd-tab-panel>
      </yd-tab>
    </div>

    <yd-backtop></yd-backtop>

    <yd-tabbar slot="tabbar">
      <yd-tabbar-item title="首页" link="/index">
        <yd-icon name="home" slot="icon"></yd-icon>
      </yd-tabbar-item>
      <yd-tabbar-item title="我的收藏" link="#" dot>
        <yd-icon name="star-outline" slot="icon"></yd-icon>
      </yd-tabbar-item>
      <yd-tabbar-item title="购物车" link="/check" dot>
        <yd-icon name="shopcart-outline" slot="icon"></yd-icon>
      </yd-tabbar-item>
      <yd-button type="warning" shape="square" style="height: 1rem;border-radius: 0px;">
        <router-link to="/check">加入购物车</router-link>
      </yd-button>
      <yd-button type="danger" shape="square" style="height: 1rem;border-radius: 0px;">
        <router-link to="/checkout">立即购买</router-link>
      </yd-button>
    </yd-tabbar>
  </yd-layout>
</template>
<script type="text/babel">
  export default {
    data () {
      return {
        spinner3: 0
      }
    },
    methods: {
      handleClick1 () {
      },
      handleClick2 () {
      }
    }
  }
</script>
